summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxI2c_regdef.h
/** \\brief  Error Interrupt Request Source Status Register */
typedef struct _Ifx_I2C_ERRIRQSS_Bits
{
    unsigned int RXF_UFL:1;                 /**< \brief [0:0] RX FIFO Underflow (rh) */
    unsigned int RXF_OFL:1;                 /**< \brief [1:1] RX FIFO Overflow (rh) */
    unsigned int TXF_UFL:1;                 /**< \brief [2:2] TX FIFO Underflow (rh) */
    unsigned int TXF_OFL:1;                 /**< \brief [3:3] TX FIFO Overflow (rh) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ERRIRQSS_Bits;

/** \\brief  Fractional Divider Configuration Register */
typedef struct _Ifx_I2C_FDIVCFG_Bits
{
    unsigned int DEC:11;                    /**< \brief [10:0] Decrement Value of Fractional Divider (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int INC:8;                     /**< \brief [23:16] Increment Value of Fractional Divider (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_I2C_FDIVCFG_Bits;

/** \\brief  Fractional Divider High-speed Mode Configuration Register */
typedef struct _Ifx_I2C_FDIVHIGHCFG_Bits
{
    unsigned int DEC:11;                    /**< \brief [10:0] Decrement Value of Fractional Divider (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int INC:8;                     /**< \brief [23:16] Increment Value of Fractional Divider (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_I2C_FDIVHIGHCFG_Bits;

/** \\brief  Filled FIFO Stages Status Register */
typedef struct _Ifx_I2C_FFSSTAT_Bits
{
    unsigned int FFS:6;                     /**< \brief [5:0] Filled FIFO Stages (rh) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_FFSSTAT_Bits;

/** \\brief  FIFO Configuration Register */
typedef struct _Ifx_I2C_FIFOCFG_Bits
{
    unsigned int RXBS:2;                    /**< \brief [1:0] RX Burst Size (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int TXBS:2;                    /**< \brief [5:4] TX Burst Size (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int RXFA:2;                    /**< \brief [9:8] RX FIFO Alignment (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int TXFA:2;                    /**< \brief [13:12] TX FIFO Alignment (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int RXFC:1;                    /**< \brief [16:16] RX FIFO Flow Control (rw) */
    unsigned int TXFC:1;                    /**< \brief [17:17] TX FIFO Flow Control (rw) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_I2C_FIFOCFG_Bits;

/** \\brief  General Purpose Control Register */
typedef struct _Ifx_I2C_GPCTL_Bits
{
    unsigned int PISEL:3;                   /**< \brief [2:0] Port Input Select (rw) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_I2C_GPCTL_Bits;

/** \\brief  Interrupt Clear Register */
typedef struct _Ifx_I2C_ICR_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (w) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (w) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (w) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_I2C_ICR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_I2C_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODNUMBER:8;               /**< \brief [15:8] Module Number Value (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_I2C_ID_Bits;

/** \\brief  Interrupt Mask Control Register */
typedef struct _Ifx_I2C_IMSC_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (rw) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (rw) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (rw) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (rw) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (rw) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_IMSC_Bits;

/** \\brief  Interrupt Set Register */
typedef struct _Ifx_I2C_ISR_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (w) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (w) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (w) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (w) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (w) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (w) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_ISR_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_I2C_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_I2C_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_I2C_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_I2C_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_I2C_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_I2C_KRSTCLR_Bits;

/** \\brief  Masked Interrupt Status Register */
typedef struct _Ifx_I2C_MIS_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (rh) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (rh) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (rh) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (rh) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (rh) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (rh) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_MIS_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_I2C_MODID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_I2C_MODID_Bits;

/** \\brief  Maximum Received Packet Size Control Register */
typedef struct _Ifx_I2C_MRPSCTRL_Bits
{
    unsigned int MRPS:14;                   /**< \brief [13:0] Maximum Received Packet Size (rwh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_I2C_MRPSCTRL_Bits;

/** \\brief  Protocol Interrupt Request Source Clear Register */
typedef struct _Ifx_I2C_PIRQSC_Bits
{
    unsigned int AM:1;                      /**< \brief [0:0] Address Match (w) */
    unsigned int GC:1;                      /**< \brief [1:1] General Call (w) */
    unsigned int MC:1;                      /**< \brief [2:2] Master Code (w) */
    unsigned int AL:1;                      /**< \brief [3:3] Arbitration Lost (w) */
    unsigned int NACK:1;                    /**< \brief [4:4] Not-acknowledge Received (w) */
    unsigned int TX_END:1;                  /**< \brief [5:5] Transmission End (w) */
    unsigned int RX:1;                      /**< \brief [6:6] Receive Mode (w) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_I2C_PIRQSC_Bits;

/** \\brief  Protocol Interrupt Request Source Mask Register */
typedef struct _Ifx_I2C_PIRQSM_Bits
{
    unsigned int AM:1;                      /**< \brief [0:0] Address Match (rw) */
    unsigned int GC:1;                      /**< \brief [1:1] General Call (rw) */
    unsigned int MC:1;                      /**< \brief [2:2] Master Code (rw) */
    unsigned int AL:1;                      /**< \brief [3:3] Arbitration Lost (rw) */
    unsigned int NACK:1;                    /**< \brief [4:4] Not-acknowledge Received (rw) */
    unsigned int TX_END:1;                  /**< \brief [5:5] Transmission End (rw) */
    unsigned int RX:1;                      /**< \brief [6:6] Receive Mode (rw) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_I2C_PIRQSM_Bits;

/** \\brief  Protocol Interrupt Request Source Status Register */
typedef struct _Ifx_I2C_PIRQSS_Bits
{
    unsigned int AM:1;                      /**< \brief [0:0] Address Match (rh) */
    unsigned int GC:1;                      /**< \brief [1:1] General Call (rh) */
    unsigned int MC:1;                      /**< \brief [2:2] Master Code (rh) */
    unsigned int AL:1;                      /**< \brief [3:3] Arbitration Lost (rh) */
    unsigned int NACK:1;                    /**< \brief [4:4] Not-acknowledge Received (rh) */
    unsigned int TX_END:1;                  /**< \brief [5:5] Transmission End (rh) */
    unsigned int RX:1;                      /**< \brief [6:6] Receive Mode (rh) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_I2C_PIRQSS_Bits;

/** \\brief  Raw Interrupt Status Register */
typedef struct _Ifx_I2C_RIS_Bits
{
    unsigned int LSREQ_INT:1;               /**< \brief [0:0] Last Single Request Interrupt (rh) */
    unsigned int SREQ_INT:1;                /**< \brief [1:1] Single Request Interrupt (rh) */
    unsigned int LBREQ_INT:1;               /**< \brief [2:2] Last Burst Request Interrupt (rh) */
    unsigned int BREQ_INT:1;                /**< \brief [3:3] Burst Request Interrupt (rh) */
    unsigned int I2C_ERR_INT:1;             /**< \brief [4:4] I2C Error Interrupt (rh) */
    unsigned int I2C_P_INT:1;               /**< \brief [5:5] I2C Protocol Interrupt (rh) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_I2C_RIS_Bits;

